#Proyecto 1 - Relacion Minutos Ingresos

In [55]:
import pandas as pd

In [146]:
#DF=pd.read_csv('../Datos/Credito_dias.csv')
df=pd.read_csv('../Datos/Credito_dias.csv',index_col="Customer_ID")

In [148]:
df.head(10)

              totmou   totrev creditcd  eqpdays
Customer_ID
1082423       7269.0   906.58        Y      371
1069232      13552.0  1172.25        N       83
1031705       4152.0   577.39        Y      675
1089806       1863.0   294.26        Y      218
1076695       4155.0   433.16        N      222
1091652       5441.0   578.80        Y       68
1043846       7294.0  1495.18        Y      460
1088967       4395.0   668.23        N      333
1045239      11544.0  1012.64        Y      498
1046584       3751.0  1199.89        Y      592

# Variables
1. totrev: Ingresos del cliente.
2. totmou: Total de minutos usados por el cliente.
3. creditcd: Indicador de tarjeta de crédito.
4. eqpdays: Número de días (antigüedad) del equipo actual.

In [69]:
df.tail(5)  # imprime los últimos n registros del DataFrame

             totmou   totrev creditcd  eqpdays
Customer_ID
1027614      2570.0   484.31        Y      611
1098422      2105.0   583.36        Y     1243
1096497      3690.0   294.29        Y      212
1087248      3333.0   233.08        Y      290
1099003      5025.0  1436.49        Y     1029

In [71]:
df.shape    # imprime el numero de columnas y filas del DataFrame

(10000, 4)

In [73]:
df.columns  # imprime el nombre de las columnas del DataFrame

Index(['totmou', 'totrev', 'creditcd', 'eqpdays'], dtype='object')

In [75]:
df.index    # imprime el indice de los registros del DataFrame

Index([1082423, 1069232, 1031705, 1089806, 1076695, 1091652, 1043846, 1088967,
       1045239, 1046584,
       ...
       1087145, 1002540, 1044082, 1083458, 1093976, 1027614, 1098422, 1096497,
       1087248, 1099003],
      dtype='int64', name='Customer_ID', length=10000)

In [77]:
df.dtypes   # imprime el tipo de cada una de las columnnas del DataFrame

totmou      float64
totrev      float64
creditcd     object
eqpdays       int64
dtype: object

In [79]:
df.sample(10)# imprime una muestra aleatoria de n registros en el DataFrame

              totmou   totrev creditcd  eqpdays
Customer_ID
1040972      26813.0  2615.33        N      263
1072533       4799.0   601.14        Y      350
1010166       1048.0  2054.80      NaN      975
1022834      24479.0  2551.83        Y      184
1015791       1963.0   899.67        Y      795
1039039       4001.0   619.76        Y      280
1039021       2654.0   886.63        Y      666
1005797       9441.0  1412.95        N      379
1080604       2050.0   265.50        Y       11
1078528       5684.0   866.70        Y      322

In [81]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10000 entries, 1082423 to 1099003
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   totmou    10000 non-null  float64
 1   totrev    10000 non-null  float64
 2   creditcd  9848 non-null   object
 3   eqpdays   10000 non-null  int64
dtypes: float64(2), int64(1), object(1)
memory usage: 390.6+ KB

In [84]:
df['totmou']

Customer_ID
1082423     7269.0
1069232    13552.0
1031705     4152.0
1089806     1863.0
1076695     4155.0
            ...
1027614     2570.0
1098422     2105.0
1096497     3690.0
1087248     3333.0
1099003     5025.0
Name: totmou, Length: 10000, dtype: float64

In [86]:
df['totmou'].mean()

np.float64(7692.8048656727005)

In [156]:
df.describe(include='all')

               totmou        totrev creditcd       eqpdays
count    10000.000000  10000.000000     9848  10000.000000
unique            NaN           NaN        2           NaN
top               NaN           NaN        Y           NaN
freq              NaN           NaN     6796           NaN
mean      7692.804866   1042.133807      NaN    386.794500
std       8657.917883    857.144895      NaN    252.720196
min          0.000000     11.100000      NaN     -5.000000
25%       2576.000000    526.787500      NaN    210.000000
50%       5262.000000    820.235000      NaN    338.000000
75%       9823.250000   1272.975000      NaN    522.000000
max     163264.176700  13426.600000      NaN   1823.000000

In [154]:
display("primeros 3 registros",df.head(3))
display("3 últimos registros",df.tail(3))
display("Columnas:",df.columns)
display("Índices:",df.index)
display("Tipos de registros en el DataFrame",df.dtypes)
display("Muestra aleatoria de 3 registros",df.sample(3))
display("dimensión",df.shape)

'primeros 3 registros'

              totmou   totrev creditcd  eqpdays
Customer_ID
1082423       7269.0   906.58        Y      371
1069232      13552.0  1172.25        N       83
1031705       4152.0   577.39        Y      675

'3 últimos registros'

             totmou   totrev creditcd  eqpdays
Customer_ID
1096497      3690.0   294.29        Y      212
1087248      3333.0   233.08        Y      290
1099003      5025.0  1436.49        Y     1029

'Columnas:'

Index(['totmou', 'totrev', 'creditcd', 'eqpdays'], dtype='object')

'Índices:'

Index([1082423, 1069232, 1031705, 1089806, 1076695, 1091652, 1043846, 1088967,
       1045239, 1046584,
       ...
       1087145, 1002540, 1044082, 1083458, 1093976, 1027614, 1098422, 1096497,
       1087248, 1099003],
      dtype='int64', name='Customer_ID', length=10000)

'Tipos de registros en el DataFrame'

totmou      float64
totrev      float64
creditcd     object
eqpdays       int64
dtype: object

'Muestra aleatoria de 3 registros'

              totmou  totrev creditcd  eqpdays
Customer_ID
1046498      22711.0  753.29        Y      104
1071120      11453.0  503.53        Y      251
1064555       1279.0  540.81        Y      295

'dimensión'

(10000, 4)

In [92]:
df.creditcd

Customer_ID
1082423    Y
1069232    N
1031705    Y
1089806    Y
1076695    N
          ..
1027614    Y
1098422    Y
1096497    Y
1087248    Y
1099003    Y
Name: creditcd, Length: 10000, dtype: object

# Manejo de datos duplicados

In [101]:
#df.duplicated({columns})
df = df.drop_duplicates()
df

              totmou   totrev creditcd  eqpdays
Customer_ID
1082423       7269.0   906.58        Y      371
1069232      13552.0  1172.25        N       83
1031705       4152.0   577.39        Y      675
1089806       1863.0   294.26        Y      218
1076695       4155.0   433.16        N      222
...              ...      ...      ...      ...
1027614       2570.0   484.31        Y      611
1098422       2105.0   583.36        Y     1243
1096497       3690.0   294.29        Y      212
1087248       3333.0   233.08        Y      290
1099003       5025.0  1436.49        Y     1029

[10000 rows x 4 columns]

## Porcentajes de nulos por columnas

In [150]:
nulos_por_columna = df.isnull().sum()
columnas_con_nulos = nulos_por_columna[nulos_por_columna > 0]

# calculo de porcentaje de los valores nulos por columna
porcentaje_nulos = (columnas_con_nulos / len(df)) * 100
porcentaje_nulos = porcentaje_nulos.round(2)
columnas_con_nulos = pd.DataFrame({
    'Cantidad de Nulos': columnas_con_nulos,
    'Porcentaje de Nulos (%)': porcentaje_nulos
})
columnas_con_nulos

          Cantidad de Nulos  Porcentaje de Nulos (%)
creditcd                152                     1.52

## Manejo de datos perdidos o esperados

In [158]:
df.isnull().any(axis=0) # Indicador de valores nulos en una columna

totmou      False
totrev      False
creditcd     True
eqpdays     False
dtype: bool

In [112]:
perd=df.isnull().any(axis=1) # Para saber si hay NaN en los datos de cada variable:
perd

Customer_ID
1082423    False
1069232    False
1031705    False
1089806    False
1076695    False
           ...
1027614    False
1098422    False
1096497    False
1087248    False
1099003    False
Length: 10000, dtype: bool

In [118]:
# Filtrar y mostrar solo las filas donde 'perd' es True
df_con_nulos = df[perd]
print(df_con_nulos)

              totmou   totrev creditcd  eqpdays
Customer_ID
1072218       5684.0   857.65      NaN      244
1066597        925.0   373.12      NaN      344
1023352      14466.0  2243.76      NaN      387
1045521       2504.0   756.79      NaN      495
1001813      76260.0  5526.11      NaN      361
...              ...      ...      ...      ...
1050795      15591.0  1330.71      NaN      447
1096985       3011.0   522.14      NaN       74
1025203        853.0   650.34      NaN      780
1099258      33660.0  4247.85      NaN      206
1026149       1955.0   606.08      NaN      770

[152 rows x 4 columns]

In [120]:
range(len(df)) # Genera secuencia de indices que se pueden usar para iterar en el edataframe

range(0, 10000)

In [122]:
for i in df.index[:10]:  # primeros 10 indices del dataframe
    print(i)

1082423
1069232
1031705
1089806
1076695
1091652
1043846
1088967
1045239
1046584

In [124]:
df[perd] # devolverá todas las filas que tienen al menos un valor nulo

              totmou   totrev creditcd  eqpdays
Customer_ID
1072218       5684.0   857.65      NaN      244
1066597        925.0   373.12      NaN      344
1023352      14466.0  2243.76      NaN      387
1045521       2504.0   756.79      NaN      495
1001813      76260.0  5526.11      NaN      361
...              ...      ...      ...      ...
1050795      15591.0  1330.71      NaN      447
1096985       3011.0   522.14      NaN       74
1025203        853.0   650.34      NaN      780
1099258      33660.0  4247.85      NaN      206
1026149       1955.0   606.08      NaN      770

[152 rows x 4 columns]

In [126]:
perdidos = df[df.isnull().any(axis=1)] # Hace lo mismo que df[perd] # devolverá todas las filas que tienen al menos un valor nulo
perdidos

              totmou   totrev creditcd  eqpdays
Customer_ID
1072218       5684.0   857.65      NaN      244
1066597        925.0   373.12      NaN      344
1023352      14466.0  2243.76      NaN      387
1045521       2504.0   756.79      NaN      495
1001813      76260.0  5526.11      NaN      361
...              ...      ...      ...      ...
1050795      15591.0  1330.71      NaN      447
1096985       3011.0   522.14      NaN       74
1025203        853.0   650.34      NaN      780
1099258      33660.0  4247.85      NaN      206
1026149       1955.0   606.08      NaN      770

[152 rows x 4 columns]

In [128]:
df['creditcd'].value_counts(dropna=False) # frecuencia de cada valor en una columna,

creditcd
Y      6796
N      3052
NaN     152
Name: count, dtype: int64

In [136]:
moda = df['creditcd'].mode()[0]
print(f'La moda en creditcd es: {moda}')

La moda en creditcd es: Y

In [140]:
df['creditcd'] = df['creditcd'].fillna("Y")# Reemplaza todos los valores faltantes (NaN) en la columna creditcd con el valor "Y"

In [ ]:
#promedio = df['totrev'].mean()
#df['totrev']=df['totrev'].replace(np.nan, promedio)

In [142]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10000 entries, 1082423 to 1099003
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   totmou    10000 non-null  float64
 1   totrev    10000 non-null  float64
 2   creditcd  10000 non-null  object
 3   eqpdays   10000 non-null  int64
dtypes: float64(2), int64(1), object(1)
memory usage: 390.6+ KB

In [144]:
# Se vuelve a verificar si existen datos nulos
df.isnull().any(axis=0)

totmou      False
totrev      False
creditcd    False
eqpdays     False
dtype: bool